of-6/OpenFOAM-6-master/tutorials/heatTransfer/chtMultiRegionFoam/multiRegionHeaterRadiation/0/topAir/G
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/topAir";
    object      G;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 0 -3 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    "(min|max)(X|Y|Z)"
    {
        type            MarshakRadiation;
        value           $internalField;
        emissivityMode  lookup;
        emissivity      uniform 1;
    }
    "topAir_to_.*"
    {
        type            MarshakRadiation;
        value           $internalField;
        emissivityMode  solidRadiation;
        emissivity      uniform 1;
    }
}


// ************************************************************************* //
